app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-08-20 06:55:37.091666"], ["id", 1]]
---
    def update
        find_student_by_id
        @student.update(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_student_by_id
        @student = Student.find(params[:id])